In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.402600 -1.721276  1.133728 -0.586875
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917
2013-01-04  0.518272 -0.746782 -1.389672  1.255396
2013-01-05  0.583117  0.635134 -0.204580  0.192663
2013-01-06 -1.668647 -0.425426  0.670714  0.512307

In [10]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.402600 -1.721276  1.133728 -0.586875
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917
2013-01-04  0.518272 -0.746782 -1.389672  1.255396
2013-01-05  0.583117  0.635134 -0.204580  0.192663

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.518272 -0.746782 -1.389672  1.255396
2013-01-05  0.583117  0.635134 -0.204580  0.192663
2013-01-06 -1.668647 -0.425426  0.670714  0.512307

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [16]:
df.values

array([[ 0.40259986, -1.72127577,  1.13372761, -0.58687517],
       [ 0.63762676,  0.5707393 , -0.70894932, -0.90552915],
       [ 0.56489865,  1.28359874,  0.81748605, -0.97191732],
       [ 0.51827233, -0.74678178, -1.38967169,  1.25539617],
       [ 0.58311693,  0.63513415, -0.20457971,  0.19266292],
       [-1.66864707, -0.42542598,  0.67071416,  0.51230725]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.172978 -0.067335  0.053121 -0.083993
std    0.905677  1.100093  0.986123  0.887952
min   -1.668647 -1.721276 -1.389672 -0.971917
25%    0.431518 -0.666443 -0.582857 -0.825866
50%    0.541585  0.072657  0.233067 -0.197106
75%    0.578562  0.619035  0.780793  0.432396
max    0.637627  1.283599  1.133728  1.255396

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.402600    0.637627    0.564899    0.518272    0.583117   -1.668647
B   -1.721276    0.570739    1.283599   -0.746782    0.635134   -0.425426
C    1.133728   -0.708949    0.817486   -1.389672   -0.204580    0.670714
D   -0.586875   -0.905529   -0.971917    1.255396    0.192663    0.512307

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.586875  1.133728 -1.721276  0.402600
2013-01-02 -0.905529 -0.708949  0.570739  0.637627
2013-01-03 -0.971917  0.817486  1.283599  0.564899
2013-01-04  1.255396 -1.389672 -0.746782  0.518272
2013-01-05  0.192663 -0.204580  0.635134  0.583117
2013-01-06  0.512307  0.670714 -0.425426 -1.668647

In [23]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.402600 -1.721276  1.133728 -0.586875
2013-01-04  0.518272 -0.746782 -1.389672  1.255396
2013-01-06 -1.668647 -0.425426  0.670714  0.512307
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-05  0.583117  0.635134 -0.204580  0.192663
2013-01-03  0.564899  1.283599  0.817486 -0.971917

In [24]:
df['A']

2013-01-01    0.402600
2013-01-02    0.637627
2013-01-03    0.564899
2013-01-04    0.518272
2013-01-05    0.583117
2013-01-06   -1.668647
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01  0.402600 -1.721276  1.133728 -0.586875
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917

In [26]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917
2013-01-04  0.518272 -0.746782 -1.389672  1.255396

In [28]:
df.loc[dates[0]]

A    0.402600
B   -1.721276
C    1.133728
D   -0.586875
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.402600 -1.721276
2013-01-02  0.637627  0.570739
2013-01-03  0.564899  1.283599
2013-01-04  0.518272 -0.746782
2013-01-05  0.583117  0.635134
2013-01-06 -1.668647 -0.425426

In [30]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.637627  0.570739
2013-01-03  0.564899  1.283599
2013-01-04  0.518272 -0.746782

In [31]:
df.loc['20130102', ['A', 'B']]

A    0.637627
B    0.570739
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
df.loc[dates[0], 'A']

0.40259985751915534

In [33]:
# Fast access
df.at[dates[0], 'A']

0.40259985751915534

In [34]:
df.iloc[3]

A    0.518272
B   -0.746782
C   -1.389672
D    1.255396
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.518272 -0.746782
2013-01-05  0.583117  0.635134

In [37]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.637627 -0.708949
2013-01-03  0.564899  0.817486
2013-01-05  0.583117 -0.204580

In [38]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917

In [39]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.721276  1.133728
2013-01-02  0.570739 -0.708949
2013-01-03  1.283599  0.817486
2013-01-04 -0.746782 -1.389672
2013-01-05  0.635134 -0.204580
2013-01-06 -0.425426  0.670714

In [40]:
df.iloc[1, 1]

0.57073930277666773

In [42]:
# Fast access
df.iat[1, 1]

0.57073930277666773

In [43]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.402600 -1.721276  1.133728 -0.586875
2013-01-02  0.637627  0.570739 -0.708949 -0.905529
2013-01-03  0.564899  1.283599  0.817486 -0.971917
2013-01-04  0.518272 -0.746782 -1.389672  1.255396
2013-01-05  0.583117  0.635134 -0.204580  0.192663

In [44]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.402600       NaN  1.133728       NaN
2013-01-02  0.637627  0.570739       NaN       NaN
2013-01-03  0.564899  1.283599  0.817486       NaN
2013-01-04  0.518272       NaN       NaN  1.255396
2013-01-05  0.583117  0.635134       NaN  0.192663
2013-01-06       NaN       NaN  0.670714  0.512307

In [46]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [47]:
df2

                   A         B         C         D      E
2013-01-01  0.402600 -1.721276  1.133728 -0.586875    one
2013-01-02  0.637627  0.570739 -0.708949 -0.905529    one
2013-01-03  0.564899  1.283599  0.817486 -0.971917    two
2013-01-04  0.518272 -0.746782 -1.389672  1.255396  three
2013-01-05  0.583117  0.635134 -0.204580  0.192663   four
2013-01-06 -1.668647 -0.425426  0.670714  0.512307  three

In [48]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.564899  1.283599  0.817486 -0.971917   two
2013-01-05  0.583117  0.635134 -0.204580  0.192663  four

In [50]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [51]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [52]:
df['F'] = s1

In [53]:
df

                   A         B         C         D    F
2013-01-01  0.402600 -1.721276  1.133728 -0.586875  NaN
2013-01-02  0.637627  0.570739 -0.708949 -0.905529  1.0
2013-01-03  0.564899  1.283599  0.817486 -0.971917  2.0
2013-01-04  0.518272 -0.746782 -1.389672  1.255396  3.0
2013-01-05  0.583117  0.635134 -0.204580  0.192663  4.0
2013-01-06 -1.668647 -0.425426  0.670714  0.512307  5.0

In [54]:
df.at[dates[0], 'A'] = 0

In [55]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.721276  1.133728 -0.586875  NaN
2013-01-02  0.637627  0.570739 -0.708949 -0.905529  1.0
2013-01-03  0.564899  1.283599  0.817486 -0.971917  2.0
2013-01-04  0.518272 -0.746782 -1.389672  1.255396  3.0
2013-01-05  0.583117  0.635134 -0.204580  0.192663  4.0
2013-01-06 -1.668647 -0.425426  0.670714  0.512307  5.0

In [56]:
df.iat[0, 1] = 0

In [57]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.133728 -0.586875  NaN
2013-01-02  0.637627  0.570739 -0.708949 -0.905529  1.0
2013-01-03  0.564899  1.283599  0.817486 -0.971917  2.0
2013-01-04  0.518272 -0.746782 -1.389672  1.255396  3.0
2013-01-05  0.583117  0.635134 -0.204580  0.192663  4.0
2013-01-06 -1.668647 -0.425426  0.670714  0.512307  5.0

In [59]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [60]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.133728  5  NaN
2013-01-02  0.637627  0.570739 -0.708949  5  1.0
2013-01-03  0.564899  1.283599  0.817486  5  2.0
2013-01-04  0.518272 -0.746782 -1.389672  5  3.0
2013-01-05  0.583117  0.635134 -0.204580  5  4.0
2013-01-06 -1.668647 -0.425426  0.670714  5  5.0

In [61]:
df2 = df.copy()
df2[df2 > 0] = -df2

In [62]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.133728 -5  NaN
2013-01-02 -0.637627 -0.570739 -0.708949 -5 -1.0
2013-01-03 -0.564899 -1.283599 -0.817486 -5 -2.0
2013-01-04 -0.518272 -0.746782 -1.389672 -5 -3.0
2013-01-05 -0.583117 -0.635134 -0.204580 -5 -4.0
2013-01-06 -1.668647 -0.425426 -0.670714 -5 -5.0

In [63]:
# Returns a copy
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1

In [64]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.133728  5  NaN  1.0
2013-01-02  0.637627  0.570739 -0.708949  5  1.0  1.0
2013-01-03  0.564899  1.283599  0.817486  5  2.0  NaN
2013-01-04  0.518272 -0.746782 -1.389672  5  3.0  NaN

In [65]:
# Returns a copy
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.637627  0.570739 -0.708949  5  1.0  1.0

In [68]:
# Returns a copy
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.133728  5  5.0  1.0
2013-01-02  0.637627  0.570739 -0.708949  5  1.0  1.0
2013-01-03  0.564899  1.283599  0.817486  5  2.0  5.0
2013-01-04  0.518272 -0.746782 -1.389672  5  3.0  5.0

In [69]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [70]:
# Operations exclude missing data

In [71]:
df.mean()

A    0.105878
B    0.219544
C    0.053121
D    5.000000
F    3.000000
dtype: float64

In [72]:
df.mean(1)

2013-01-01    1.533432
2013-01-02    1.299883
2013-01-03    1.933197
2013-01-04    1.276364
2013-01-05    2.002734
2013-01-06    1.715328
Freq: D, dtype: float64

In [73]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [74]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [75]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.435101  0.283599 -0.182514  4.0  1.0
2013-01-04 -2.481728 -3.746782 -4.389672  2.0  0.0
2013-01-05 -4.416883 -4.364866 -5.204580  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [78]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.133728   5   NaN
2013-01-02  0.637627  0.570739  0.424778  10   1.0
2013-01-03  1.202525  1.854338  1.242264  15   3.0
2013-01-04  1.720798  1.107556 -0.147407  20   6.0
2013-01-05  2.303915  1.742690 -0.351987  25  10.0
2013-01-06  0.635268  1.317264  0.318727  30  15.0

In [79]:
df.apply(lambda x: x.max() - x.min())

A    2.306274
B    2.030381
C    2.523399
D    0.000000
F    4.000000
dtype: float64

In [80]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [81]:
s

0    4
1    4
2    6
3    0
4    0
5    4
6    3
7    1
8    6
9    5
dtype: int64

In [82]:
s.value_counts()

4    3
6    2
0    2
5    1
3    1
1    1
dtype: int64

In [83]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [84]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [85]:
df = pd.DataFrame(np.random.randn(10, 4))

In [86]:
df

          0         1         2         3
0 -0.646260  0.187220 -0.589647 -0.539957
1 -1.461520 -1.138432 -0.114480 -0.149171
2 -0.481511 -2.160390 -0.929236 -1.596683
3 -0.876124 -0.222996 -0.107076 -0.150451
4 -1.134816  0.089247 -1.177559  1.328197
5 -1.064924  0.425571 -0.095298  0.624862
6 -0.412812 -0.280896 -1.093396 -0.112713
7  1.068766 -0.623516 -1.434729  0.852470
8  1.399878  1.364981  0.585851 -0.851638
9  1.946689 -0.633283 -0.432743 -0.734342

In [87]:
# Break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [88]:
pd.concat(pieces)

          0         1         2         3
0 -0.646260  0.187220 -0.589647 -0.539957
1 -1.461520 -1.138432 -0.114480 -0.149171
2 -0.481511 -2.160390 -0.929236 -1.596683
3 -0.876124 -0.222996 -0.107076 -0.150451
4 -1.134816  0.089247 -1.177559  1.328197
5 -1.064924  0.425571 -0.095298  0.624862
6 -0.412812 -0.280896 -1.093396 -0.112713
7  1.068766 -0.623516 -1.434729  0.852470
8  1.399878  1.364981  0.585851 -0.851638
9  1.946689 -0.633283 -0.432743 -0.734342

In [90]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [91]:
left

   key  lval
0  foo     1
1  foo     2

In [95]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [96]:
right

   key  rval
0  foo     4
1  foo     5

In [97]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [98]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [99]:
df

          A         B         C         D
0  1.155769 -0.608527  1.411979 -1.410240
1  0.838204  0.661659  1.036438  0.480956
2 -2.217679 -2.898211  0.081599 -0.094278
3  2.029560 -0.097298  1.224583  0.776978
4  1.215542 -0.349897  0.353383 -2.136354
5  0.630228 -2.503151  2.015103  0.287067
6  0.131455  0.802409 -1.299510  0.862253
7  1.463459  0.887465 -0.270217  1.164961

In [100]:
s = df.iloc[3]

In [101]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.155769 -0.608527  1.411979 -1.410240
1  0.838204  0.661659  1.036438  0.480956
2 -2.217679 -2.898211  0.081599 -0.094278
3  2.029560 -0.097298  1.224583  0.776978
4  1.215542 -0.349897  0.353383 -2.136354
5  0.630228 -2.503151  2.015103  0.287067
6  0.131455  0.802409 -1.299510  0.862253
7  1.463459  0.887465 -0.270217  1.164961
8  2.029560 -0.097298  1.224583  0.776978

In [102]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [103]:
df

     A      B         C         D
0  foo    one -0.502612 -1.252053
1  bar    one  1.781324 -0.346685
2  foo    two  1.373232 -0.552545
3  bar  three -0.002497  1.414919
4  foo    two  1.830918 -1.601929
5  bar    two  0.917946 -1.989906
6  foo    one  1.233652 -0.247597
7  foo  three -1.195522  1.368023

In [106]:
df.groupby('A').sum()

            C         D
A
bar  2.696773 -0.921671
foo  2.739668 -2.286101

In [107]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.781324 -0.346685
    three -0.002497  1.414919
    two    0.917946 -1.989906
foo one    0.731040 -1.499650
    three -1.195522  1.368023
    two    3.204150 -2.154474